<template>
    <el-space wrap>
        <el-card style="max-width: 480px; min-width: 300px">
            <template #header>
                <div class="card-header">
                    <el-text size="large"><el-icon size="large">
                            <TrendCharts />
                        </el-icon> 可视化数据大屏</el-text>
                </div>
            </template>
            <p class="text item">通过大屏幕数据可视化，可以将大量的数据信息以图表、图像等形式呈现出来</p>
            <p class="text item">使得信息更加直观、清晰，有利于用户快速了解数据内容</p>
            <p class="text item">准确把握信息要点，提高信息传达效率</p>
            <template #footer>
                <a href="/data"><el-button icon="Link" target="_Blank">前往</el-button></a>
            </template>
        </el-card>

        <el-card style="max-width: 480px; min-width: 300px">
            <template #header>
                <div class="card-header">
                    <el-text size="large"><el-icon size="large">
                            <Document />
                        </el-icon> 服务端API文档</el-text>
                </div>
            </template>
            <p class="text item">API 文档是一份规范</p>
            <p class="text item">它描述了每个API接口的请求方法、请求URL、请求参数、响应格式等</p>
            <p class="text item">帮助开发者理解如何正确调用接口</p>
            <template #footer>
                <a href="https://soms-fastapi-110860-4-1327191391.sh.run.tcloudbase.com/docs"
                    style="margin-right: 20px;" target="_Blank"><el-button icon="Link">Swagger文档</el-button></a>
                <a href="https://soms-fastapi-110860-4-1327191391.sh.run.tcloudbase.com/redoc"
                    target="_Blank"><el-button icon="Link">ReDoc文档</el-button></a>
            </template>
        </el-card>

        <el-card style="max-width: 480px; min-width: 300px">
            <template #header>
                <div class="card-header">
                    <el-text size="large">
                        <el-icon size="large">
                            <svg t="1718648497825" class="icon" viewBox="0 0 1024 1024" version="1.1"
                                xmlns="http://www.w3.org/2000/svg" p-id="6639" width="32" height="32">
                                <path
                                    d="M512 1024C229.6832 1024 0 794.3168 0 512S229.6832 0 512 0s512 229.6832 512 512-229.6832 512-512 512z m0-960C265.0112 64 64 265.0112 64 512S265.0112 960 512 960 960 758.9888 960 512 758.9888 64 512 64z"
                                    p-id="6640"></path>
                                <path
                                    d="M363.1104 828.8256c-41.5744 0-82.944-12.8-116.1216-38.912-36.7616-28.9792-58.6752-69.8368-61.7472-114.9952-3.072-46.3872 14.0288-91.3408 48.128-126.464l94.3104-97.28a32.02048 32.02048 0 0 1 45.9776 44.544l-94.3104 97.1776c-21.4016 22.016-32.0512 49.5616-30.208 77.6192 1.7408 26.8288 15.0528 51.3024 37.4784 69.0176 49.664 39.1168 126.7712 32.8704 172.032-13.7216 32.1536-33.1776 46.2848-76.0832 38.8096-117.9648l-32.8704-183.7056c-10.9568-61.2352 9.1136-123.4944 54.8864-170.7008l0.512-0.512c67.4816-69.0176 182.6816-77.6192 257.1264-18.944 36.7616 28.9792 58.7776 69.8368 61.7472 114.9952 3.072 46.3872-14.0288 91.3408-48.128 126.464l-93.3888 96.256a32.02048 32.02048 0 0 1-45.9776-44.544l93.3888-96.256c21.4016-22.016 32.0512-49.5616 30.208-77.6192-1.8432-26.8288-15.1552-51.3024-37.4784-69.0176-49.5616-39.0144-126.7712-32.8704-172.032 13.7216l-0.4096 0.4096c-31.0272 32.256-44.6464 73.9328-37.4784 114.4832l32.8704 183.7056c11.1616 62.3616-9.216 125.6448-55.9104 173.7728-37.376 38.6048-89.6 58.4704-141.4144 58.4704z"
                                    p-id="6641"></path>
                            </svg>
                        </el-icon>
                        微信小程序
                    </el-text>
                </div>
            </template>
            <p class="text item">成果提交小程序</p>
            <p class="text item">用于提供学生提交成果</p>
            <p class="text item">开发中...</p>
            <template #footer>
                <el-button icon="Link" disabled>开发中</el-button>
            </template>
        </el-card>

        <el-card style="max-width: 480px; min-width: 300px">
            <template #header>
                <div class="card-header">
                    <el-text size="large">
                        <el-icon size="large">
                            <svg t="1718648707312" class="icon" viewBox="0 0 1024 1024" version="1.1"
                                xmlns="http://www.w3.org/2000/svg" p-id="7834" width="32" height="32">
                                <path
                                    d="M910.422866 893.19984 790.027242 772.662164c31.304559-42.578778 49.832623-95.126739 49.832623-151.932168 0-141.623697-115.085541-256.849246-256.539593-256.849246S326.784766 479.105277 326.784766 620.729996c0 141.625741 115.081453 256.850267 256.535505 256.850267 56.736958 0 109.221557-18.550547 151.750259-49.892918l120.396647 120.537677c7.590068 7.593134 17.531657 11.392766 27.478355 11.392766 9.947721 0 19.888287-3.799633 27.478355-11.393788C925.597892 933.026491 925.597892 908.39224 910.422866 893.19984zM583.320271 814.358994c-106.638052 0-193.38986-86.863202-193.38986-193.628998 0-106.765796 86.751808-193.627976 193.38986-193.627976 106.63703 0 193.39497 86.861158 193.39497 193.627976C776.71422 727.496814 689.957301 814.358994 583.320271 814.358994z"
                                    p-id="7835"></path>
                                <path
                                    d="M251.215202 631.364471c0-181.288878 146.780487-328.252295 327.843513-328.252295 110.880192 0 208.904176 55.11307 268.23588 139.472479l0-318.421078C847.294595 91.175856 820.559202 64.383234 787.579657 64.383234L161.910547 64.383234C128.933046 64.383234 102.195609 91.147242 102.195609 124.162555l0 775.672846C102.195609 932.824144 128.931002 959.616766 161.910547 959.616766l417.148168 0C397.995689 959.616766 251.215202 812.653349 251.215202 631.364471zM221.411896 183.747705c0-16.481086 13.343681-29.841118 29.804327-29.841118l447.0598 0c16.459625 0 29.804327 13.360032 29.804327 29.841118 0 16.480064-13.343681 29.841118-29.804327 29.841118L251.215202 213.588822C234.755577 213.588822 221.411896 200.227768 221.411896 183.747705z"
                                    p-id="7836"></path>
                            </svg>
                        </el-icon>
                        审核页
                    </el-text>
                </div>
            </template>
            <p class="text item">Web端成果审核页面</p>
            <p class="text item">用于提供教师审核学生提交的成果</p>
            <p class="text item">开发中...</p>
            <template #footer>
                <el-button icon="Link" disabled>开发中</el-button>
            </template>
        </el-card>
    </el-space>

</template>

<script>

export default {
    name: 'Main',
    data() {
        return {}
    },
    mounted() {
    }
}
</script>

<style>
.card-header {
    font-size: 18px;
}

.text {
    padding: 5px 0;
}
</style>
